{
  "id": "038172d4-0215-479b-a1f2-305405834b1c",
  "type": "Full Time",
  "url": "https://jobs.github.com/positions/038172d4-0215-479b-a1f2-305405834b1c",
  "created_at": "Fri Mar 26 18:42:21 UTC 2021",
  "company": "AXOVISION GmbH",
  "company_url": "http://www.axovision.com",
  "location": "Hanover",
  "title": "Senior Software Engineer (m/f/d)  - Remote",
  "description": "<p><em>We are a growing financial technology startup optimising asset management via artificial intelligence. This position is defined as a remote role and can be handled from everywhere.</em></p>\n<p><strong>About the Role:</strong></p>\n<p>We are looking for a Software Engineer to join our growing Software Tech Stack. AXOVISION is developing machine learning models that operate in a fully automated financial trading system. Hence, we need a highly talented and motivated Software Engineer, with experience in Data Engineering and the ability to deploy machine learning models in production. First experience in the field of software development within the financial domain would be desirable. Since this is a smaller development team, you will be included in several steps within the data value chain, especially in deploying the machine learning models in production. Furthermore, you will be working on AXOVISION’s trading simulation software infrastructure, as well as the live trading system, which includes development and deployment / monitoring tasks.</p>\n<p><strong>What You’ll Do:</strong></p>\n<ul>\n<li>Work on several software projects concerning: Live-Trading, Simulation-Trading, Portfolio Analysis, Deployment of Machine Learning Models</li>\n<li>Build a professional data storage and processing pipeline to deploy developed Machine Learning applications</li>\n<li>Extend the inhouse testing environment by implementing new features for back and forward testing quantitative strategies</li>\n<li>Monitor Live-Trading production systems with State of the Art DevOps Tools</li>\n<li>Develop and construct new modern software products around financial domain use cases</li>\n<li>You will be facing tasks from fields of a Data Engineer and Software Developer</li>\n</ul>\n<p><strong>Skills &amp; Qualifications:</strong></p>\n<p><em>Education / General</em></p>\n<ul>\n<li>Minimum Bachelor’s Degree, preferably Master’s Degree (accredited school) in Computer Science, Math, Physics, Engineering or other technical field.</li>\n<li>Relevant experience of 2-4 years with Bachelor’s degree, or 1-3 years with PhD/Master’s</li>\n<li>Self-organization and entrepreneurial spirit</li>\n<li>Clear communication</li>\n</ul>\n<p><em>Data Engineering</em></p>\n<ul>\n<li>Experience with database solutions of relational and non relational type (SQL and No-SQL technologies)</li>\n<li>Appropriate knowledge of design and maintenance of Big Data solutions</li>\n<li>Able to report technical findings and develop data pipeline solutions</li>\n</ul>\n<p><em>Software Development</em></p>\n<ul>\n<li>Familiar and comfortable with Agile/DevOps/ methodologies, to monitor software production systems</li>\n<li>Able to create various machine learning-based tools or processes</li>\n<li>Excellent skills and experience in a high level programming language like C, C++, Go, Java etc. and additionally in a scripting language like Python, Ruby, JavaScript, etc.\nPreferred C++ and Python</li>\n<li>Knowledge in deploying ML models in cloud environments like AWS, GCP, Azure etc. with technologies like Docker, Kubernetes or other container management systems for Microservice architecture</li>\n<li>Experienced knowledge in designing backend technologies for Microservice architecture like REST APIs, Messaging Systems, API-Gateways etc.</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<ul>\n<li>Challenging tasks in the software engineering domain with scope for own ideas and experiences</li>\n<li>Working with a small, highly motivated team in an inspiring atmosphere</li>\n<li>Team-oriented and collaborative company culture</li>\n<li>Competitive compensation based on experience</li>\n<li>Ability to extend your knowledge by advanced trainings and self-empowerment</li>\n<li>Flexible working hours</li>\n<li>Remote working</li>\n</ul>\n",
  "how_to_apply": "<p>Email your CV at <a href=\"mailto:info@axovision.com\">info@axovision.com</a></p>\n",
  "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbjJlIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--3a7b3675fea960eaf3431f6609dfca93300004ff/Black%20logo%20-%20no%20background.png"
}
